backend/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    @questions = Question.all

    render json: Question.all, include: [answers: {only: [:content]}], except: [:created_at, :updated_at]